In [1]:
import pandas as pd
import numpy as np

In [38]:
a={"id":[1,2,3,4],"sem":["1st","2nd","3rd","4th"],"name":["rahul","john","mark","muzamil"],"marks":[40,80,67,89]}

In [39]:
df1=pd.DataFrame(a,index=["oop","DS","cpp","java"])

In [40]:
df1

      id  marks     name  sem
oop    1     40    rahul  1st
DS     2     80     john  2nd
cpp    3     67     mark  3rd
java   4     89  muzamil  4th

In [67]:
b={"id":[1,2,5,6],"sem":["1st","2nd","3rd","4th"],"name":["rahul","john","mark","muzamil"],"marks":[40,80,67,89]}

In [68]:
df2=pd.DataFrame(b,index=["oop","DS","cpp","java"])

In [71]:
df2

      id  marks     name  sem
oop    1     40    rahul  1st
DS     2     80     john  2nd
cpp    5     67     mark  3rd
java   6     89  muzamil  4th

In [73]:
d3=pd.merge(df1,df2)

In [74]:
d3

   id  marks   name  sem
0   1     40  rahul  1st
1   2     80   john  2nd

In [84]:
d4=pd.merge(df1,df2 ,on=["id","marks"])

In [85]:
d4

   id  marks name_x sem_x name_y sem_y
0   1     40  rahul   1st  rahul   1st
1   2     80   john   2nd   john   2nd

In [82]:
d5=pd.merge(df1,df2 ,on=["id","marks"],how="left")

In [83]:
d5

   id  marks   name_x sem_x name_y sem_y
0   1     40    rahul   1st  rahul   1st
1   2     80     john   2nd   john   2nd
2   3     67     mark   3rd    NaN   NaN
3   4     89  muzamil   4th    NaN   NaN

In [78]:
d6=pd.merge(df1,df2 ,on="id",how="right")

In [79]:
d6

   id  marks_x name_x sem_x  marks_y   name_y sem_y
0   1     40.0  rahul   1st       40    rahul   1st
1   2     80.0   john   2nd       80     john   2nd
2   5      NaN    NaN   NaN       67     mark   3rd
3   6      NaN    NaN   NaN       89  muzamil   4th

In [80]:
d7=pd.merge(df1,df2 ,on="id",how="outer")

In [81]:
d7

   id  marks_x   name_x sem_x  marks_y   name_y sem_y
0   1     40.0    rahul   1st     40.0    rahul   1st
1   2     80.0     john   2nd     80.0     john   2nd
2   3     67.0     mark   3rd      NaN      NaN   NaN
3   4     89.0  muzamil   4th      NaN      NaN   NaN
4   5      NaN      NaN   NaN     67.0     mark   3rd
5   6      NaN      NaN   NaN     89.0  muzamil   4th

In [58]:
d={"id":[1,2,3,4],"sem":["1st","2nd","3rd","4th"],"name":["rahul","john","mark","muzamil"],"marks":[40,80,67,89]}

In [60]:
df0=pd.DataFrame(d)

In [61]:
df0

   id  marks     name  sem
0   1     40    rahul  1st
1   2     80     john  2nd
2   3     67     mark  3rd
3   4     89  muzamil  4th

In [59]:
e={"id":[1,2,5,6],"sem":["1st","2nd","3rd","4th"],"name":["rahul","john","mark","muzamil"],"marks":[40,80,67,89]}

In [62]:
df9=pd.DataFrame(e)

In [63]:
df9

   id  marks     name  sem
0   1     40    rahul  1st
1   2     80     john  2nd
2   5     67     mark  3rd
3   6     89  muzamil  4th

In [64]:
d11=pd.merge(df0,df9,left_index=True,right_index=True)

In [65]:
d11

   id_x  marks_x   name_x sem_x  id_y  marks_y   name_y sem_y
0     1       40    rahul   1st     1       40    rahul   1st
1     2       80     john   2nd     2       80     john   2nd
2     3       67     mark   3rd     5       67     mark   3rd
3     4       89  muzamil   4th     6       89  muzamil   4th